from datetime import datetime

# 中国政府规定的节假日
chinese_holidays=[
    #################################################################
    #2020年
    # 元旦节	1月1日放假	无调休	共1天
    # 春节	1月24日(除夕)~2月2日	1月19日(周日)上班	共10天
    # 清明节	4月4日~4月6日	无调休	共3天
    # 劳动节	5月1日~5月5日	4月26日(周日)、5月9日(周六)上班	共5天
    # 端午节	6月25日~6月27日	6月28日(周日)上班	共3天
    # 中秋节	10月1日~10月8日	9月27日(周日)、10月10日(周六)上班	共8天
    # 国庆节	10月1日~10月8日	9月27日(周日)、10月10日(周六)上班	共8天
    #################################################################
    "2020-01-01",
    "2020-01-24",
    "2020-01-25",
    "2020-01-26",
    "2020-01-27",
    "2020-01-28",
    "2020-01-29",
    "2020-01-30",
    "2020-01-31",
    "2020-02-01",
    "2020-02-02",
    "2020-04-04",
    "2020-04-05",
    "2020-04-05",
    "2020-05-01",
    "2020-05-02",
    "2020-05-03",
    "2020-05-04",
    "2020-05-05",
    "2020-06-25",
    "2020-06-26",
    "2020-06-27",
    "2020-10-01",
    "2020-10-02",
    "2020-10-03",
    "2020-10-04",
    "2020-10-05",
    "2020-10-06",
    "2020-10-07",
    "2020-10-08",

    #2021年
]

# 中国政府规定的调休工作日
chinese_workdays=[
    "2020-01-19",
    "2020-04-26",
    "2020-05-09",
    "2020-06-28",
    "2020-09-27",
    "2020-10-10",
]

def isHoliday(d):
    # 要求是str,格式是2020-05-01
    if not isinstance(d, str):
        print("date formate error")
        raise Exception("date formate error")
        return
    d1 = datetime.strptime(d, '%Y-%m-%d')
    if d1.year < 2020:
        print("only support year 2020 and later")
        raise Exception("only support year 2020 and later")
        return

    # 开始判断
    if d in chinese_holidays:
        return True
    elif d in chinese_workdays:
        return False
    elif d1.weekday() in (5, 6):
        return True
    else:
        return False

if __name__ == "__main__":
    day = "2020-05-11"
    print(isHoliday(day))